app/policies/book_policy.rb

SELECT "authors".* FROM "authors" INNER JOIN "authors_books" ON "authors"."id" = "authors_books"."author_id" WHERE "authors_books"."book_id" = ?  [["book_id", 2]]
SELECT  "authors".* FROM "authors" WHERE "authors"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def update?
    current_author = user.author
    author_ids = record.authors.map(&:id)
    user.admin || author_ids.include?(current_author&.id)

SELECT "authors".* FROM "authors" INNER JOIN "authors_books" ON "authors"."id" = "authors_books"."author_id" WHERE "authors_books"."book_id" = ?  [["book_id", 2]]
SELECT  "authors".* FROM "authors" WHERE "authors"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def destroy?
    current_author = user.author
    author_ids = record.authors.map(&:id)
    user.admin || author_ids.include?(current_author&.id)

SELECT "authors".* FROM "authors" INNER JOIN "authors_books" ON "authors"."id" = "authors_books"."author_id" WHERE "authors_books"."book_id" = ?  [["book_id", 1]]
SELECT  "authors".* FROM "authors" WHERE "authors"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def add_author?
    current_author = user.author
    author_ids = record.authors.map(&:id)
    user.admin || author_ids.include?(current_author&.id)

SELECT "authors".* FROM "authors" INNER JOIN "authors_books" ON "authors"."id" = "authors_books"."author_id" WHERE "authors_books"."book_id" = ?  [["book_id", 1]]
SELECT  "authors".* FROM "authors" WHERE "authors"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def remove_author?
    current_author = user.author
    author_ids = record.authors.map(&:id)
    user.admin || author_ids.include?(current_author&.id)

SELECT "authors".* FROM "authors" INNER JOIN "authors_books" ON "authors"."id" = "authors_books"."author_id" WHERE "authors_books"."book_id" = ?  [["book_id", 1]]
SELECT  "authors".* FROM "authors" WHERE "authors"."user_id" = ? LIMIT ?  [["user_id", 14], ["LIMIT", 1]]
---
  def add_category?
    current_author = user.author
    author_ids = record.authors.map(&:id)
    user.admin || author_ids.include?(current_author&.id)

SELECT "authors".* FROM "authors" INNER JOIN "authors_books" ON "authors"."id" = "authors_books"."author_id" WHERE "authors_books"."book_id" = ?  [["book_id", 1]]
SELECT  "authors".* FROM "authors" WHERE "authors"."user_id" = ? LIMIT ?  [["user_id", 14], ["LIMIT", 1]]
---
  def remove_category?
    current_author = user.author
    author_ids = record.authors.map(&:id)
    user.admin || author_ids.include?(current_author&.id)