app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def authentication
      decode_data = decode_user_data(request.cookies["session"])
      user_id = decode_data[0]["user_id"] unless !decode_data
      user = User.find(user_id) if user_id