app/controllers/authors_controller.rb

SELECT  "authors".* FROM "authors" LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
  def index
    authors = Author.page(params[:page])

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    author = Author.find_by(id: params[:id])

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "authors" SET "updated_at" = ?, "invite_token" = ? WHERE "authors"."id" = ?  [["updated_at", "2022-09-14 15:51:17.429381"], ["invite_token", "WOocaTfTEe9xAvpFhKkOJQ"], ["id", 2]]
---
  def invite_author
    author = Author.find(params[:author_id])
    render json: {message: "user_id is present"}, status: :unprocessable_entity if author.user_id.nil?
    authorize! author
    token = SecureRandom.urlsafe_base64
    author.invite_token = token
    # TODO: ADD SEND MAIL
    if author.save