app/controllers/books_controller.rb

UPDATE "books" SET "updated_at" = ?, "name" = ?, "description" = ? WHERE "books"."id" = ?  [["updated_at", "2022-09-10 16:30:13.153896"], ["name", "test2"], ["description", "jdhgsdfyg,fykga,rfygrv,uhdafrghi"], ["id", 2]]
---
  def update
    authorize! @book
    if @book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_book
    @book = Book.find_by(id: params[:id])