app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @books = Book.page(params[:page])

INSERT INTO "authors" ("user_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 15], ["name", "trest"], ["created_at", "2022-10-26 17:51:54.300369"], ["updated_at", "2022-10-26 17:51:54.300369"]]
SELECT  "authors".* FROM "authors" WHERE "authors"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Action and Adventure"], ["created_at", "2022-08-30 09:40:47.943496"], ["updated_at", "2022-08-30 09:40:47.943496"]]
INSERT INTO "books" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "looool"], ["description", "testtestetsetsetstet"], ["created_at", "2022-08-30 10:10:43.928271"], ["updated_at", "2022-08-30 10:10:43.928271"]]
INSERT INTO "books" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test2.0"], ["description", "testtestetsetsetstet"], ["created_at", "2022-10-09 11:26:46.488201"], ["updated_at", "2022-10-09 11:26:46.488201"]]
---
  def create
    author = (Author.find_by(user_id: user.id) || Author.create(user_id: user.id, name: user.username))
    # author = Author.find_by(user_id: user.id)
    # author = Author.create(user_id: user.id, name: user.username) unless author

    category = Category.find(params[:book][:category_id])

    @book = Book.new(book_params)
    @book.categories << category
    @book.authors << author

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def add_author
    authorize! @book
    find_author
    if @author_ids.include?(params[:author_id])
      render json: { message: 'author is present' }
    elsif (author = Author.find_by(id: params[:author_id])).present?

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 2]]
---
  def remove_author
    authorize! @book
    find_author
    author = Author.find_by(id: params[:author_id])
    if @author_ids.include?(params[:author_id])
      @book.authors.delete(author)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def add_category
    authorize! @book
    find_category
    if @categories_ids.include?(params[:category_id])
      render json: { message: 'category is present' }
    elsif (category = Category.find_by(id: params[:category_id])).present?

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
---
  def remove_category
    authorize! @book
    find_category
    category = Category.find_by(id: params[:category_id])
    if @categories_ids.include?(params[:category_id])
      @book.categories.delete(category)

UPDATE "books" SET "updated_at" = ?, "name" = ?, "description" = ? WHERE "books"."id" = ?  [["updated_at", "2022-09-10 16:30:13.153896"], ["name", "test2"], ["description", "jdhgsdfyg,fykga,rfygrv,uhdafrghi"], ["id", 2]]
---
  def update
    authorize! @book
    if @book.update(book_params)

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 2]]
---
  def destroy
    authorize! @book
    @book.destroy

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_book
    @book = Book.find_by(id: params[:id])

INSERT INTO "books" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test4"], ["description", "testtestetsetsetstet"], ["created_at", "2022-10-26 17:51:54.521695"], ["updated_at", "2022-10-26 17:51:54.521695"]]
---
  def save_book
    if @book.save

SELECT "authors".* FROM "authors" INNER JOIN "authors_books" ON "authors"."id" = "authors_books"."author_id" WHERE "authors_books"."book_id" = ?  [["book_id", 4]]
---
  def find_author
    @author_ids = @book.authors.map(&:id)

SELECT "categories".* FROM "categories" INNER JOIN "books_categories" ON "categories"."id" = "books_categories"."category_id" WHERE "books_categories"."book_id" = ?  [["book_id", 1]]
---
 def find_category
   @categories_ids = @book.categories.map(&:id)