app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
  def index
    @categories = Category.page(params[:page])