app/controllers/comments_controller.rb

  def index
    comments = Comment.where(book_id: @book.id).page(params[:page])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."book_id" = ? LIMIT ? OFFSET ?  [["book_id", 1], ["LIMIT", 25], ["OFFSET", 0]]

  def create
    comment = Comment.new(comment_params)
    if comment.save
---
INSERT INTO "comments" ("book_id", "user_id", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["book_id", 1], ["user_id", 1], ["value", "test"], ["created_at", "2022-09-10 19:28:07.363609"], ["updated_at", "2022-09-10 19:28:07.363609"]]

  def update
    @comment = Comment.find(params[:id])
    authorize! @comment
    if @comment.update(update_comment)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "comments" SET "updated_at" = ?, "value" = ? WHERE "comments"."id" = ?  [["updated_at", "2022-09-10 19:55:36.974936"], ["value", "test1"], ["id", 1]]

  def destroy
    @comment = Comment.find(params[:id])
    authorize! @comment
    @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]

  def set_book
    @book = Book.find_by(id: params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]