app/controllers/users_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."invite_token" = ? AND "authors"."user_id" IS NULL LIMIT ?  [["invite_token", "KvhoXAtrYxspRtC0PpfeVQ"], ["LIMIT", 1]]
UPDATE "authors" SET "user_id" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["user_id", 7], ["updated_at", "2022-10-07 11:43:13.954090"], ["id", 1]]
---
  def create
    user = User.new(user_params)
    if (token = params['user']['invite_token'])
      author = Author.find_by(invite_token: token, user_id: nil)
      (render(json: { message: 'author not found' }, status: :unprocessable_entity) && return) unless author
      save_user(user) { author.update(user_id: user.id) } && return

UPDATE "users" SET "email" = ?, "phone_number" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "ttstttest@gmail.com"], ["phone_number", "5228899504"], ["updated_at", "2022-08-23 18:29:53.694083"], ["id", 4]]
---
  def update
    if @user.update(user_update_params)

INSERT INTO "users" ("username", "email", "password", "phone_number", "admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def save_user(user)
    if user.save