app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("username", "email", "password", "phone_number", "admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)